{
  "glossary": [
    {"term": "SEO", "definition": "Search Engine Optimization - the practice of improving website visibility in search engine results."},
    {"term": "SERP", "definition": "Search Engine Results Page - the page displayed by a search engine in response to a query."},
    {"term": "Backlink", "definition": "A link from one website to another, important for SEO authority."},
    {"term": "Keyword", "definition": "A word or phrase that describes the content of a webpage and is used by search engines for indexing."},
    {"term": "Meta Description", "definition": "A brief summary of a webpage's content that appears in search results."},
    {"term": "Alt Text", "definition": "Alternative text description of an image, used for accessibility and SEO."},
    {"term": "Canonical URL", "definition": "The preferred version of a webpage when there are duplicate or similar content pages."},
    {"term": "Domain Authority", "definition": "A search engine ranking score that predicts how likely a website is to rank on search engine result pages."}
  ],
  "chatbots": [
    {"title": "ChatGPT", "description": "AI assistant that can help with content creation, SEO strategy, and code generation."},
    {"title": "Claude", "description": "AI assistant helpful for analyzing content and generating SEO recommendations."},
    {"title": "Bing Chat", "description": "Microsoft's AI-powered search chatbot for answering SEO questions."}
  ],
  "blog": [
    {"slug": "seo-basics", "title": "SEO Basics: Getting Started", "excerpt": "Learn the fundamentals of search engine optimization and how to improve your rankings."},
    {"slug": "keyword-research", "title": "Complete Guide to Keyword Research", "excerpt": "Discover how to find and target the right keywords for your business."},
    {"slug": "technical-seo", "title": "Technical SEO Checklist", "excerpt": "Essential technical elements to check for optimal website performance."}
  ],
  "extensions": [
    {"name": "Lighthouse", "description": "Google's tool for auditing website performance, accessibility, and SEO.", "link": "https://chrome.google.com/webstore/detail/lighthouse"},
    {"name": "SEO Minion", "description": "All-in-one SEO tool for keyword analysis, on-page SEO, and link checking.", "link": "https://chrome.google.com/webstore/detail/seo-minion"},
    {"name": "MozBar", "description": "Free SEO toolbar that provides instant metrics while viewing any page.", "link": "https://chrome.google.com/webstore/detail/mozbar"}
  ]
}